In [1]:
# Pandas

In [3]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame([1,2,3,4,5])

In [4]:
df

   0
0  1
1  2
2  3
3  4
4  5

In [8]:
df1 = pd.DataFrame([
    [4,5,6,6],
    [34,2,55,23]
])

In [9]:
df1

    0  1   2   3
0   4  5   6   6
1  34  2  55  23

In [10]:
df3=pd.DataFrame(
    {
        'english':[38,45,54,44,66],
        'science':[56,76,44,77,78],
        'maths':[78,56,43,77,44]
    })

In [11]:
df3

   english  science  maths
0       38       56     78
1       45       76     56
2       54       44     43
3       44       77     77
4       66       78     44

In [13]:
df3.index=['aman','kamal','karan','zaid','kajal']

In [14]:
df3

       english  science  maths
aman        38       56     78
kamal       45       76     56
karan       54       44     43
zaid        44       77     77
kajal       66       78     44

In [15]:
# list of lists
english = [45,65,66,34,67,43,77,43]
maths   = [89,54,87,56,96,45,89,99]
science = [89,76,87,54,45,67,66,54]
subjects = [english , maths,science]

In [16]:
subjects

[[45, 65, 66, 34, 67, 43, 77, 43],
 [89, 54, 87, 56, 96, 45, 89, 99],
 [89, 76, 87, 54, 45, 67, 66, 54]]

In [35]:
subjects_df = pd.DataFrame(subjects,columns=['aman','kamal','karan','zaid','kajal','raman','john','kirn'],index=['english','math','science'])

In [36]:
subjects_df

         aman  kamal  karan  zaid  kajal  raman  john  kirn
english    45     65     66    34     67     43    77    43
math       89     54     87    56     96     45    89    99
science    89     76     87    54     45     67    66    54

In [37]:
subjects_df = pd.DataFrame(subjects,columns=['aman','kamal','karan','zaid','kajal','raman','john','kirn'],index=['english','math','science']).T
# here t is transpose as previously names was columns and subjects was rows then we transpose

In [38]:
subjects_df

       english  math  science
aman        45    89       89
kamal       65    54       76
karan       66    87       87
zaid        34    56       54
kajal       67    96       45
raman       43    45       67
john        77    89       66
kirn        43    99       54

In [39]:
df1 = df1.T

In [40]:
df1

   0   1
0  4  34
1  5   2
2  6  55
3  6  23

In [53]:
sub_name=['english','maths']
name = ['aman','kamal','karan','zaid']

In [54]:
df1.columns = sub_name

In [55]:
df1.index = name

In [56]:
df1

       english  maths
aman         4     34
kamal        5      2
karan        6     55
zaid         6     23

In [57]:
data = [
    {"name":"raman","age":22,"marks":54},
    {"name":"samar","age":24,"marks":84},
    {"name":"sajan","age":26,"marks":34},
    {"name":"rocky","age":28,"marks":44},
]

In [58]:
data_df= pd.DataFrame(data)

In [59]:
data_df

    name  age  marks
0  raman   22     54
1  samar   24     84
2  sajan   26     34
3  rocky   28     44

In [69]:
data2 = {
   "a":  {"name":"raman","age":22,"marks":54},
   "b": {"name":"samar","age":24,"marks":84},
    "c":{"name":"sajan","age":26,"marks":34},
    "d": {"name":"rocky","age":28,"marks":44},
}

In [70]:
data_2_df=pd.DataFrame(data2)

In [71]:
data_2_df

           a      b      c      d
name   raman  samar  sajan  rocky
age       22     24     26     28
marks     54     84     34     44

In [74]:
new_data = np.array([
    [1,2,3,4],
    [3,4,5,3],
    [9,8,7,5]
])

In [78]:
data_new_df= pd.DataFrame(new_data.T,columns=['a','b','c'])

In [79]:
data_new_df

   a  b  c
0  1  3  9
1  2  4  8
2  3  5  7
3  4  3  5

In [1]:
# Practice

In [6]:
# 1. Create dataframe
df_1 = pd.DataFrame([2,3,4,5],columns=['col_name'])

In [7]:
df_1

   col_name
0         2
1         3
2         4
3         5

In [8]:
print(type(df_1))

<class 'pandas.DataFrame'>

In [75]:
data = {
    'Name':["madhav","sahil","jashan","sakshi"],
    'Age':[16,17,15,45],
    'salary':[40000,45888,56000,34000]
}

In [76]:
df = pd.DataFrame(data)
print(df)

     Name  Age  salary
0  madhav   16   40000
1   sahil   17   45888
2  jashan   15   56000
3  sakshi   45   34000

In [77]:
df.head(2)

     Name  Age  salary
0  madhav   16   40000
1   sahil   17   45888

In [78]:
df.tail(2)

     Name  Age  salary
2  jashan   15   56000
3  sakshi   45   34000

In [79]:
df.shape

(4, 3)

In [80]:
df.columns

Index(['Name', 'Age', 'salary'], dtype='str')

In [81]:
df.rename(columns={"salary":"monthly_salary"},inplace=True)

In [82]:
df

     Name  Age  monthly_salary
0  madhav   16           40000
1   sahil   17           45888
2  jashan   15           56000
3  sakshi   45           34000

In [83]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            4 non-null      str
 1   Age             4 non-null      int64
 2   monthly_salary  4 non-null      int64
dtypes: int64(2), str(1)
memory usage: 228.0 bytes

In [84]:
df.describe()

            Age  monthly_salary
count   4.00000        4.000000
mean   23.25000    43972.000000
std    14.52297     9373.035936
min    15.00000    34000.000000
25%    15.75000    38500.000000
50%    16.50000    42944.000000
75%    24.00000    48416.000000
max    45.00000    56000.000000

In [85]:
# save and load data from csv

In [86]:
# save
df.to_csv("Test_data.csv",index=False)

In [87]:
# load
load_df = pd.read_csv("Test_data.csv")

In [88]:
load_df

     Name  Age  monthly_salary
0  madhav   16           40000
1   sahil   17           45888
2  jashan   15           56000
3  sakshi   45           34000

In [89]:
# rows and columns selection

In [90]:
df["Name"]

0    madhav
1     sahil
2    jashan
3    sakshi
Name: Name, dtype: str

In [91]:
df[["Name","Age"]]

     Name  Age
0  madhav   16
1   sahil   17
2  jashan   15
3  sakshi   45

In [92]:
# loc label based index
df.loc[df.Name=="madhav"]

     Name  Age  monthly_salary
0  madhav   16           40000

In [93]:
df.loc[df.index==2]

     Name  Age  monthly_salary
2  jashan   15           56000

In [94]:
# iloc : index value based
df.iloc[0]

Name              madhav
Age                   16
monthly_salary     40000
Name: 0, dtype: object

In [95]:
df.iloc[0:2]

     Name  Age  monthly_salary
0  madhav   16           40000
1   sahil   17           45888

In [96]:
df.loc[0:2]
# loc is including 2 value also but in iloc its not includeing the last index value

     Name  Age  monthly_salary
0  madhav   16           40000
1   sahil   17           45888
2  jashan   15           56000

In [97]:
# dataframe filter

In [98]:
df

     Name  Age  monthly_salary
0  madhav   16           40000
1   sahil   17           45888
2  jashan   15           56000
3  sakshi   45           34000

In [99]:
df["Age"] > 15

0     True
1     True
2    False
3     True
Name: Age, dtype: bool

In [100]:
df_filter_age=df[df["Age"]>16]

In [101]:
df[(df["Age"]>14) &(df["monthly_salary"]>40000)]

     Name  Age  monthly_salary
1   sahil   17           45888
2  jashan   15           56000

In [102]:
df.where((df["Age"]>14) &(df["monthly_salary"]>40000))
# by using where the shape of the dataframe doesn't changed the rows which doesn't satified the cond. shows NAN value

     Name   Age  monthly_salary
0     NaN   NaN             NaN
1   sahil  17.0         45888.0
2  jashan  15.0         56000.0
3     NaN   NaN             NaN

In [103]:
df.where((df["Age"]>14) &(df["monthly_salary"]>40000),other="Not Eligible")

           Name           Age monthly_salary
0  Not Eligible  Not Eligible   Not Eligible
1         sahil            17          45888
2        jashan            15          56000
3  Not Eligible  Not Eligible   Not Eligible

In [104]:
# rows and col operation : add, update , delete

In [105]:
df

     Name  Age  monthly_salary
0  madhav   16           40000
1   sahil   17           45888
2  jashan   15           56000
3  sakshi   45           34000

In [106]:
# add new column
df["Designation"]=['CEO','HR','CTO','DA']

In [107]:
df

     Name  Age  monthly_salary Designation
0  madhav   16           40000         CEO
1   sahil   17           45888          HR
2  jashan   15           56000         CTO
3  sakshi   45           34000          DA

In [108]:
df['Bonus']=df["monthly_salary"]*0.2
df

     Name  Age  monthly_salary Designation    Bonus
0  madhav   16           40000         CEO   8000.0
1   sahil   17           45888          HR   9177.6
2  jashan   15           56000         CTO  11200.0
3  sakshi   45           34000          DA   6800.0

In [109]:
# add new rows
df.loc[len(df)]=["ABC",21,34000,'IT',3000]

In [110]:
df

     Name  Age  monthly_salary Designation    Bonus
0  madhav   16           40000         CEO   8000.0
1   sahil   17           45888          HR   9177.6
2  jashan   15           56000         CTO  11200.0
3  sakshi   45           34000          DA   6800.0
4     ABC   21           34000          IT   3000.0

In [111]:
len(df)

5

In [112]:
# update value
df.loc[0,"monthly_salary"]=45000

In [113]:
df

     Name  Age  monthly_salary Designation    Bonus
0  madhav   16           45000         CEO   8000.0
1   sahil   17           45888          HR   9177.6
2  jashan   15           56000         CTO  11200.0
3  sakshi   45           34000          DA   6800.0
4     ABC   21           34000          IT   3000.0

In [114]:
df.loc[df.Name=="madhav","monthly_salary"]=48000

In [115]:
df

     Name  Age  monthly_salary Designation    Bonus
0  madhav   16           48000         CEO   8000.0
1   sahil   17           45888          HR   9177.6
2  jashan   15           56000         CTO  11200.0
3  sakshi   45           34000          DA   6800.0
4     ABC   21           34000          IT   3000.0

In [120]:
# delete value
df.drop(df[df.Name=="ABC"].index,inplace = True)

In [122]:
df.drop("Bonus",axis=1,inplace = True)

In [123]:
df.drop(0,axis=0)

     Name  Age  monthly_salary Designation
1   sahil   17           45888          HR
2  jashan   15           56000         CTO
3  sakshi   45           34000          DA

In [125]:
# value sort
df.sort_values("monthly_salary")

     Name  Age  monthly_salary Designation
3  sakshi   45           34000          DA
1   sahil   17           45888          HR
0  madhav   16           48000         CEO
2  jashan   15           56000         CTO

In [126]:
df.sort_values("monthly_salary",ascending=False)

     Name  Age  monthly_salary Designation
2  jashan   15           56000         CTO
0  madhav   16           48000         CEO
1   sahil   17           45888          HR
3  sakshi   45           34000          DA

In [127]:
# working with date values

In [128]:
df["DOJ"]=['2024-01-02','2023-01-23','2024-06-12','2024-12-22']

In [129]:
df

     Name  Age  monthly_salary Designation         DOJ
0  madhav   16           48000         CEO  2024-01-02
1   sahil   17           45888          HR  2023-01-23
2  jashan   15           56000         CTO  2024-06-12
3  sakshi   45           34000          DA  2024-12-22

In [130]:
df['DOJ'].dtype

In [131]:
df['DOJ']=pd.to_datetime(df['DOJ'])

In [132]:
df

     Name  Age  monthly_salary Designation        DOJ
0  madhav   16           48000         CEO 2024-01-02
1   sahil   17           45888          HR 2023-01-23
2  jashan   15           56000         CTO 2024-06-12
3  sakshi   45           34000          DA 2024-12-22

In [133]:
df['DOJ'].dtype

dtype('<M8[us]')

In [134]:
df2=df

In [135]:
df2

     Name  Age  monthly_salary Designation        DOJ
0  madhav   16           48000         CEO 2024-01-02
1   sahil   17           45888          HR 2023-01-23
2  jashan   15           56000         CTO 2024-06-12
3  sakshi   45           34000          DA 2024-12-22

In [138]:
df2['DOJ2']=['02-01-2023','23-08-2025','06-12-2024','12-02-2024']
df2

     Name  Age  monthly_salary Designation        DOJ        DOJ2
0  madhav   16           48000         CEO 2024-01-02  02-01-2023
1   sahil   17           45888          HR 2023-01-23  23-08-2025
2  jashan   15           56000         CTO 2024-06-12  06-12-2024
3  sakshi   45           34000          DA 2024-12-22  12-02-2024

In [142]:
df2['DOJ2']=pd.to_datetime(df2['DOJ2'],format='%d-%m-%Y')

In [143]:
df2

     Name  Age  monthly_salary Designation        DOJ       DOJ2
0  madhav   16           48000         CEO 2024-01-02 2023-01-02
1   sahil   17           45888          HR 2023-01-23 2025-08-23
2  jashan   15           56000         CTO 2024-06-12 2024-12-06
3  sakshi   45           34000          DA 2024-12-22 2024-02-12

In [144]:
df

     Name  Age  monthly_salary Designation        DOJ       DOJ2
0  madhav   16           48000         CEO 2024-01-02 2023-01-02
1   sahil   17           45888          HR 2023-01-23 2025-08-23
2  jashan   15           56000         CTO 2024-06-12 2024-12-06
3  sakshi   45           34000          DA 2024-12-22 2024-02-12

In [145]:
df.drop("DOJ2",axis=1)

     Name  Age  monthly_salary Designation        DOJ
0  madhav   16           48000         CEO 2024-01-02
1   sahil   17           45888          HR 2023-01-23
2  jashan   15           56000         CTO 2024-06-12
3  sakshi   45           34000          DA 2024-12-22

In [153]:
# to find year or month,week,day form the data
df['DOJ'].dt.year
df['DOJ'].dt.date
df['DOJ'].dt.day
df['DOJ'].dt.day_name()

0      Tuesday
1       Monday
2    Wednesday
3       Sunday
Name: DOJ, dtype: str

In [154]:
df["Month"]=df['DOJ'].dt.month

In [155]:
df

     Name  Age  monthly_salary Designation        DOJ       DOJ2  Month
0  madhav   16           48000         CEO 2024-01-02 2023-01-02      1
1   sahil   17           45888          HR 2023-01-23 2025-08-23      1
2  jashan   15           56000         CTO 2024-06-12 2024-12-06      6
3  sakshi   45           34000          DA 2024-12-22 2024-02-12     12

In [158]:
# want to add probation days
df['DOJ'] + pd.Timedelta(days=90)

0   2024-04-01
1   2023-04-23
2   2024-09-10
3   2025-03-22
Name: DOJ, dtype: datetime64[us]

In [159]:
# handling missing values

In [160]:
df.isnull()

    Name    Age  monthly_salary  Designation    DOJ   DOJ2  Month
0  False  False           False        False  False  False  False
1  False  False           False        False  False  False  False
2  False  False           False        False  False  False  False
3  False  False           False        False  False  False  False

In [162]:
df.loc[df.Name=="sakshi","monthly_salary"]=np.nan

In [163]:
df

     Name  Age  monthly_salary Designation        DOJ       DOJ2  Month
0  madhav   16         48000.0         CEO 2024-01-02 2023-01-02      1
1   sahil   17         45888.0          HR 2023-01-23 2025-08-23      1
2  jashan   15         56000.0         CTO 2024-06-12 2024-12-06      6
3  sakshi   45             NaN          DA 2024-12-22 2024-02-12     12

In [164]:
df.isnull()

    Name    Age  monthly_salary  Designation    DOJ   DOJ2  Month
0  False  False           False        False  False  False  False
1  False  False           False        False  False  False  False
2  False  False           False        False  False  False  False
3  False  False            True        False  False  False  False

In [165]:
df.isnull().sum()

Name              0
Age               0
monthly_salary    1
Designation       0
DOJ               0
DOJ2              0
Month             0
dtype: int64

In [166]:
# aggregation and group by

In [167]:
df['Designation'].value_counts()

Designation
CEO    1
HR     1
CTO    1
DA     1
Name: count, dtype: int64

In [168]:
df['Month'].value_counts()

Month
1     2
6     1
12    1
Name: count, dtype: int64

In [169]:
# filter + aggregation
df[df["Month"]==1].value_counts()

Name    Age  monthly_salary  Designation  DOJ         DOJ2        Month
madhav  16   48000.0         CEO          2024-01-02  2023-01-02  1        1
sahil   17   45888.0         HR           2023-01-23  2025-08-23  1        1
Name: count, dtype: int64

In [170]:
# group by
df.groupby("Month")['monthly_salary'].sum()

Month
1     93888.0
6     56000.0
12        0.0
Name: monthly_salary, dtype: float64

In [171]:
df.groupby("Month")['monthly_salary'].mean()

Month
1     46944.0
6     56000.0
12        NaN
Name: monthly_salary, dtype: float64

In [172]:
df.groupby('Month').agg({'monthly_salary':"mean", "Name":"count"})

       monthly_salary  Name
Month
1             46944.0     2
6             56000.0     1
12                NaN     1

In [173]:
# concatenate and merge

In [174]:
df1=pd.DataFrame({
    "id":[1,2,3],
    "name":['A','B','C']
})
df1

   id name
0   1    A
1   2    B
2   3    C

In [175]:
df2=pd.DataFrame({
    "id":[1,2,4,3],
    "score":[89,78,56,78]
})
df2

   id  score
0   1     89
1   2     78
2   4     56
3   3     78

In [176]:
pd.concat([df1,df2],axis=0)

   id name  score
0   1    A    NaN
1   2    B    NaN
2   3    C    NaN
0   1  NaN   89.0
1   2  NaN   78.0
2   4  NaN   56.0
3   3  NaN   78.0

In [177]:
pd.concat([df1,df2],axis=1)

    id name  id  score
0  1.0    A   1     89
1  2.0    B   2     78
2  3.0    C   4     56
3  NaN  NaN   3     78

In [178]:
# merge = join
pd.merge(df1,df2,how='inner',on='id')

   id name  score
0   1    A     89
1   2    B     78
2   3    C     78

In [179]:
pd.merge(df1,df2,how='left',on='id')

   id name  score
0   1    A     89
1   2    B     78
2   3    C     78

In [180]:
pd.merge(df1,df2,how='right',on='id')

   id name  score
0   1    A     89
1   2    B     78
2   4  NaN     56
3   3    C     78

In [181]:
pd.merge(df1,df2,how='inner',left_on='id',right_on='id')

   id name  score
0   1    A     89
1   2    B     78
2   3    C     78